robsanchez3/03_bootloader/STM32CubeIDE/Startup/startup_stm32u599nihxq.s
	.weak	COMP_IRQHandler
	.thumb_set COMP_IRQHandler,Default_Handler

	.weak	OTG_HS_IRQHandler
	.thumb_set OTG_HS_IRQHandler,Default_Handler

	.weak	CRS_IRQHandler
	.thumb_set CRS_IRQHandler,Default_Handler

	.weak	FMC_IRQHandler
	.thumb_set FMC_IRQHandler,Default_Handler

	.weak	OCTOSPI1_IRQHandler
	.thumb_set OCTOSPI1_IRQHandler,Default_Handler

	.weak	PWR_S3WU_IRQHandler
	.thumb_set PWR_S3WU_IRQHandler,Default_Handler

	.weak	SDMMC1_IRQHandler
	.thumb_set SDMMC1_IRQHandler,Default_Handler

	.weak	SDMMC2_IRQHandler
	.thumb_set SDMMC2_IRQHandler,Default_Handler

	.weak	GPDMA1_CH8_IRQHandler
	.thumb_set GPDMA1_CH8_IRQHandler,Default_Handler

	.weak	GPDMA1_CH9_IRQHandler
	.thumb_set GPDMA1_CH9_IRQHandler,Default_Handler

	.weak	GPDMA1_CH10_IRQHandler
	.thumb_set GPDMA1_CH10_IRQHandler,Default_Handler

	.weak	GPDMA1_CH11_IRQHandler
	.thumb_set GPDMA1_CH11_IRQHandler,Default_Handler

	.weak	GPDMA1_CH12_IRQHandler
	.thumb_set GPDMA1_CH12_IRQHandler,Default_Handler

	.weak	GPDMA1_CH13_IRQHandler
	.thumb_set GPDMA1_CH13_IRQHandler,Default_Handler

	.weak	GPDMA1_CH14_IRQHandler
	.thumb_set GPDMA1_CH14_IRQHandler,Default_Handler

	.weak	GPDMA1_CH15_IRQHandler
	.thumb_set GPDMA1_CH15_IRQHandler,Default_Handler

	.weak	I2C3_EV_IRQHandler
	.thumb_set I2C3_EV_IRQHandler,Default_Handler

	.weak	I2C3_ER_IRQHandler
	.thumb_set I2C3_ER_IRQHandler,Default_Handler

	.weak	SAI1_IRQHandler
	.thumb_set SAI1_IRQHandler,Default_Handler

	.weak	SAI2_IRQHandler
	.thumb_set SAI2_IRQHandler,Default_Handler

	.weak	TSC_IRQHandler
	.thumb_set TSC_IRQHandler,Default_Handler

	.weak	RNG_IRQHandler
	.thumb_set RNG_IRQHandler,Default_Handler

	.weak	FPU_IRQHandler
	.thumb_set FPU_IRQHandler,Default_Handler

	.weak	HASH_IRQHandler
	.thumb_set HASH_IRQHandler,Default_Handler

	.weak	LPTIM3_IRQHandler
	.thumb_set LPTIM3_IRQHandler,Default_Handler

	.weak	SPI3_IRQHandler
	.thumb_set SPI3_IRQHandler,Default_Handler

	.weak	I2C4_ER_IRQHandler
	.thumb_set I2C4_ER_IRQHandler,Default_Handler

	.weak	I2C4_EV_IRQHandler
	.thumb_set I2C4_EV_IRQHandler,Default_Handler

	.weak	MDF1_FLT0_IRQHandler
	.thumb_set MDF1_FLT0_IRQHandler,Default_Handler

	.weak	MDF1_FLT1_IRQHandler
	.thumb_set MDF1_FLT1_IRQHandler,Default_Handler

	.weak	MDF1_FLT2_IRQHandler
	.thumb_set MDF1_FLT2_IRQHandler,Default_Handler

	.weak	MDF1_FLT3_IRQHandler
	.thumb_set MDF1_FLT3_IRQHandler,Default_Handler

	.weak	UCPD1_IRQHandler
	.thumb_set UCPD1_IRQHandler,Default_Handler

	.weak	ICACHE_IRQHandler
	.thumb_set ICACHE_IRQHandler,Default_Handler

	.weak	LPTIM4_IRQHandler
	.thumb_set LPTIM4_IRQHandler,Default_Handler

	.weak	DCACHE1_IRQHandler
	.thumb_set DCACHE1_IRQHandler,Default_Handler

	.weak	ADF1_FLT0_IRQHandler
	.thumb_set ADF1_FLT0_IRQHandler,Default_Handler

	.weak	ADC4_IRQHandler
	.thumb_set ADC4_IRQHandler,Default_Handler

	.weak	LPDMA1_CH0_IRQHandler
	.thumb_set LPDMA1_CH0_IRQHandler,Default_Handler

	.weak	LPDMA1_CH1_IRQHandler
	.thumb_set LPDMA1_CH1_IRQHandler,Default_Handler

	.weak	LPDMA1_CH2_IRQHandler
	.thumb_set LPDMA1_CH2_IRQHandler,Default_Handler

	.weak	LPDMA1_CH3_IRQHandler
	.thumb_set LPDMA1_CH3_IRQHandler,Default_Handler

	.weak	DMA2D_IRQHandler
	.thumb_set DMA2D_IRQHandler,Default_Handler

	.weak	DCMI_PSSI_IRQHandler
	.thumb_set DCMI_PSSI_IRQHandler,Default_Handler

	.weak	OCTOSPI2_IRQHandler
	.thumb_set OCTOSPI2_IRQHandler,Default_Handler

	.weak	MDF1_FLT4_IRQHandler
	.thumb_set MDF1_FLT4_IRQHandler,Default_Handler

	.weak	MDF1_FLT5_IRQHandler
	.thumb_set MDF1_FLT5_IRQHandler,Default_Handler

	.weak	CORDIC_IRQHandler
	.thumb_set CORDIC_IRQHandler,Default_Handler

	.weak	FMAC_IRQHandler
	.thumb_set FMAC_IRQHandler,Default_Handler

	.weak	LSECSSD_IRQHandler
	.thumb_set LSECSSD_IRQHandler,Default_Handler

	.weak	USART6_IRQHandler
	.thumb_set USART6_IRQHandler,Default_Handler

	.weak	I2C5_ER_IRQHandler
	.thumb_set I2C5_ER_IRQHandler,Default_Handler

	.weak	I2C5_EV_IRQHandler
	.thumb_set I2C5_EV_IRQHandler,Default_Handler

	.weak	I2C6_ER_IRQHandler
	.thumb_set I2C6_ER_IRQHandler,Default_Handler

	.weak	I2C6_EV_IRQHandler
	.thumb_set I2C6_EV_IRQHandler,Default_Handler

	.weak	HSPI1_IRQHandler
	.thumb_set HSPI1_IRQHandler,Default_Handler

	.weak	GPU2D_IRQ_IRQHandler
	.thumb_set GPU2D_IRQ_IRQHandler,Default_Handler

	.weak	GPU2D_IRQSYS_IRQHandler
	.thumb_set GPU2D_IRQSYS_IRQHandler,Default_Handler

	.weak	GFXMMU_IRQHandler
	.thumb_set GFXMMU_IRQHandler,Default_Handler

	.weak	LCD_TFT_IRQHandler
	.thumb_set LCD_TFT_IRQHandler,Default_Handler

	.weak	LCD_TFT_ERR_IRQHandler
	.thumb_set LCD_TFT_ERR_IRQHandler,Default_Handler

	.weak	DSIHOST_IRQHandler
	.thumb_set DSIHOST_IRQHandler,Default_Handler

	.weak	DCACHE2_IRQHandler
	.thumb_set DCACHE2_IRQHandler,Default_Handler

	.weak	SystemInit

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
